## Production: app
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 3 to add, 0 to change, 3 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                    NAME                     |
|----------|---------------------------------------------|
| recreate | `aws_appautoscaling_policy.forms_cpu[0]`    |
|          | `aws_appautoscaling_policy.forms_memory[0]` |
|          | `aws_appautoscaling_target.forms[0]`        |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_appautoscaling_policy.forms_cpu[0] must be replaced
-/+ resource "aws_appautoscaling_policy" "forms_cpu" {
      ~ alarm_arns         = [
          - "arn:aws:cloudwatch:ca-central-1:957818836222:alarm:TargetTracking-service/arn:aws:ecs:ca-central-1:957818836222:cluster/Forms/form-viewer-AlarmHigh-6429dc44-fcab-4a58-a786-55d7cdca2fba",
          - "arn:aws:cloudwatch:ca-central-1:957818836222:alarm:TargetTracking-service/arn:aws:ecs:ca-central-1:957818836222:cluster/Forms/form-viewer-AlarmLow-6c1e15b6-3678-4a64-aaad-0803d8a00deb",
        ] -> (known after apply)
      ~ arn                = "arn:aws:autoscaling:ca-central-1:957818836222:scalingPolicy:77ac9dfa-5c17-4fa7-97bd-1660621ba969:resource/ecs/service/arn:aws:ecs:ca-central-1:957818836222:cluster/Forms/form-viewer:policyName/forms_cpu" -> (known after apply)
      ~ id                 = "forms_cpu" -> (known after apply)
        name               = "forms_cpu"
      ~ resource_id        = "service/arn:aws:ecs:ca-central-1:957818836222:cluster/Forms/form-viewer" -> "service/Forms/form-viewer" # forces replacement
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_appautoscaling_policy.forms_memory[0] must be replaced
-/+ resource "aws_appautoscaling_policy" "forms_memory" {
      ~ alarm_arns         = [
          - "arn:aws:cloudwatch:ca-central-1:957818836222:alarm:TargetTracking-service/arn:aws:ecs:ca-central-1:957818836222:cluster/Forms/form-viewer-AlarmHigh-1c63ac0a-0a36-43eb-9c40-428ab49824e5",
          - "arn:aws:cloudwatch:ca-central-1:957818836222:alarm:TargetTracking-service/arn:aws:ecs:ca-central-1:957818836222:cluster/Forms/form-viewer-AlarmLow-9862b225-e8db-4f9d-a704-76f3d9657a80",
        ] -> (known after apply)
      ~ arn                = "arn:aws:autoscaling:ca-central-1:957818836222:scalingPolicy:77ac9dfa-5c17-4fa7-97bd-1660621ba969:resource/ecs/service/arn:aws:ecs:ca-central-1:957818836222:cluster/Forms/form-viewer:policyName/forms_memory" -> (known after apply)
      ~ id                 = "forms_memory" -> (known after apply)
        name               = "forms_memory"
      ~ resource_id        = "service/arn:aws:ecs:ca-central-1:957818836222:cluster/Forms/form-viewer" -> "service/Forms/form-viewer" # forces replacement
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_appautoscaling_target.forms[0] must be replaced
-/+ resource "aws_appautoscaling_target" "forms" {
      + arn                = (known after apply)
      ~ id                 = "service/arn:aws:ecs:ca-central-1:957818836222:cluster/Forms/form-viewer" -> (known after apply)
      ~ resource_id        = "service/arn:aws:ecs:ca-central-1:957818836222:cluster/Forms/form-viewer" -> "service/Forms/form-viewer" # forces replacement
      ~ role_arn           = "arn:aws:iam::957818836222:role/aws-service-role/ecs.application-autoscaling.amazonaws.com/AWSServiceRoleForApplicationAutoScaling_ECSService" -> (known after apply)
      - tags               = {} -> null
      ~ tags_all           = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_appautoscaling_target.forms[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.forms"]
WARN - plan.json - main - Missing Common Tags: ["aws_codedeploy_app.app"]
WARN - plan.json - main - Missing Common Tags: ["aws_codedeploy_deployment_group.app"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_cluster.forms"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_service.form_viewer"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_task_definition.form_viewer"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.cognito"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.forms_dynamodb"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.forms_kms"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.forms_s3"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.forms_secrets_manager"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.forms_sqs"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.codedeploy"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.forms"]

34 tests, 19 passed, 15 warnings, 0 failures, 0 exceptions

```

</details>
